

BOOKS_BY_GENRE = {
    "Дюна": "Фантастика",
    "Основание": "Фантастика",
    "Оно": "Ужасы",
    "Зов Ктулху": "Ужасы",
    "Убийство в «Восточном экспрессе»": "Детективы",
    "Собака Баскервилей": "Детективы",
    "Холодное сердце. История Анны и Эльзы": "Мультфильмы",
    "Король Лев. Официальная новеллизация": "Мультфильмы",
    "Трое в лодке, не считая собаки": "Комедии",
    "Похождения бравого солдата Швейка": "Комедии"
}

FORBIDDEN_GENRES_FOR_CHILDREN = ["Ужасы", "Детективы"]

BOOK_AGE_RATING = [book for book, genre in BOOKS_BY_GENRE.items() if genre in FORBIDDEN_GENRES_FOR_CHILDREN]